fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
  <attributes>
    <name>Планировщик</name>
    <type>
      <types>Planner</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧасовКОплатеПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПланировщик() Экспорт
	
	ВыборкаСпециалист = ДанныеИзДокументовОбслуживаниеКлиента();

	ЗаполнитьПланировщикДанными(ВыборкаСпециалист);

	ВыполнитьНастройкуПланировщика();

КонецПроцедуры 

Функция ДанныеИзДокументовОбслуживаниеКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК ДокументСсылка,
		|	ВКМ_ОбслуживаниеКлиента.Представление КАК Представление
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ИТОГИ
		|ПО
		|	Специалист";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСпециалист = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаСпециалист;
	
КонецФункции

Процедура ЗаполнитьПланировщикДанными(ВыборкаСпециалист)
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
    Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоНедели(ТекущаяДатаСеанса()), КонецНедели(ТекущаяДатаСеанса()));
	ИзмеренияПланировщика = Планировщик.Измерения;
	ИзмеренияПланировщика.Очистить();
	
	ИзмерениеСпециалисты  = ИзмеренияПланировщика.Добавить("Специалисты");

	ЭлементыПланировщика = Планировщик.Элементы;
    ЭлементыПланировщика.Очистить();
	
	Пока ВыборкаСпециалист.Следующий() Цикл
		НовыйСпециалист = ИзмерениеСпециалисты.Элементы.Добавить(ВыборкаСпециалист.Специалист);
        НовыйСпециалист.Текст = ВыборкаСпециалист.Специалист.Наименование;

		ВыборкаДетальныеЗаписи = ВыборкаСпециалист.Выбрать();
		СоответствиеЗначений = Новый Соответствие;
       	СоответствиеЗначений.Вставить("Специалисты",   ВыборкаСпециалист.Специалист);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВремяНачалоВСекундах = ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан;
			СекундыНачало = 60 * 60 * Час(ВремяНачалоВСекундах) + 60 * Минута(ВремяНачалоВСекундах) + Секунда(ВремяНачалоВСекундах);
        	Начало  = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + СекундыНачало;
        	ВремяКонцаВСекундах = ВыборкаДетальныеЗаписи.ВремяОкончанияРаботПлан;
			СекундыКонец = 60 * 60 * Час(ВремяКонцаВСекундах) + 60 * Минута(ВремяКонцаВСекундах) + Секунда(ВремяКонцаВСекундах);
        	Конец   = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + СекундыКонец;
        	НовыйЭлемент = ЭлементыПланировщика.Добавить(Начало, Конец);
        	НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
        	НовыйЭлемент.Текст = ВыборкаДетальныеЗаписи.Представление;
        	НовыйЭлемент.Значение = ВыборкаДетальныеЗаписи.ДокументСсылка;

		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьНастройкуПланировщика()
	
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	Планировщик.КратностьПериодическогоВарианта = 24;
	Планировщик.ОтступСНачалаПереносаШкалыВремени = 8;
	Планировщик.ОтступСКонцаПереносаШкалыВремени = 5;
	Планировщик.ВыравниватьГраницыЭлементовПоШкалеВремени = Ложь;
	Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='дддд, д ММММ гггг'";
	
КонецПроцедуры

Процедура СоздатьДокументыОбслуживаниеКлиентов(ДанныеДляДокументов) Экспорт
	
	ДокОбслуживаниеСсылка = Документы.ВКМ_ОбслуживаниеКлиента.СоздатьДокументИзКалендаря(ДанныеДляДокументов[0]);
	Если ДокОбслуживаниеСсылка = Неопределено Тогда
		ТекстСообщения = "Документ обслуживание клиента не создан";
		Сообщение = Новый СообщениеПользователю;
    	Сообщение.Текст = ТекстСообщения;
    	Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Создан документ %1",ДокОбслуживаниеСсылка);
	ЗаполнитьПланировщик();
	Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
